dfponte/projetos_esp32_microC/proj_07.1_adc_oneshot_calib_esp32/main/main.c
#include <stdio.h>

//RTOS
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

//ESP-IDF
#include "esp_adc/adc_oneshot.h"
#include "esp_log.h"

static const char* TAG = "ADC TEST";

static int adc_raw;     // ADC raw data
static int voltage;     // ADC voltage

static bool example_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle); // ADC calibration init
static void example_adc_calibration_deinit(adc_cali_handle_t handle);                                                               // ADC calibration deinit


void app_main(void)
{
  adc_oneshot_unit_handle_t adc1_handler;
  adc_oneshot_unit_init_cfg_t init_config1 ={
    .unit_id = ADC_UNIT_1
  };

  ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1,&adc1_handler));
  
 adc_oneshot_chan_cfg_t config = {
    .bitwidth = ADC_BITWIDTH_DEFAULT,  
    .atten = ADC_ATTEN_DB_11

 };
  
 ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handler,ADC_CHANNEL_0,&config));


 //-------------ADC1 Calibration Init---------------//
adc_cali_handle_t adc1_cali_chan0_handle = NULL;    // ADC1 Calibration handle
bool do_calibration1_chan0 = example_adc_calibration_init(ADC_UNIT_1, ADC_CHANNEL_0, ADC_ATTEN_DB_11, &adc1_cali_chan0_handle); // ADC1 Calibration Init



 while(true){
      
    ESP_ERROR_CHECK(adc_oneshot_read(adc1_handler,ADC_CHANNEL_0,&adc_raw));
    ESP_LOGI(TAG,"ADC%d Channel[%d] Raw Data: %d",ADC_UNIT_1+1,ADC_CHANNEL_0,adc_raw);
    if(do_calibration1_chan0){
        ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_chan0_handle,adc_raw,&voltage));
        ESP_LOGI(TAG,"ADC%d Channel[%d] Voltage: %d",ADC_UNIT_1+1,ADC_CHANNEL_0,voltage);
    }
    vTaskDelay(1000/portTICK_PERIOD_MS);
    // Bits 
             
 }

}


//--------------ADC Routine Calibration------------------
static bool example_adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if (!calibrated)
    {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
        adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
        if (ret == ESP_OK)
        {
            calibrated = true;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if (!calibrated)
    {
        ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
        adc_cali_line_fitting_config_t cali_config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
        if (ret == ESP_OK)
        {
            calibrated = true;
        }
    }
#endif

    *out_handle = handle;
    if (ret == ESP_OK)
    {
        ESP_LOGI(TAG, "Calibration Success");
    }
    else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated)
    {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    }
    else
    {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

    return calibrated;
}

static void example_adc_calibration_deinit(adc_cali_handle_t handle)
{
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
    ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
#endif
    }